Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Mahāyāna Sūtra The King of Samādhis, the Revealed Equality of the Nature of All Phenomena

source: །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to all the buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time:

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་འབུམ་དུ་ཚང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་དང་ཡང་ཐབས་ཅིག་སྟེ། ཐམས་ཅད་ཀྱང་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། མངོན་པར་ཤེས་པས་མངོན་པར་ཤེས་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ནས་འདུས་པ།
en: The Bhagavān was residing at Vulture Peak Mountain in Rājagṛha together with a great bhikṣu saṅgha of a full hundred thousand bhikṣus, and together with eighty quintillion bodhisattvas, all of whom had one rebirth remaining, were renowned for their higher cognitions, and had gathered there from the worlds in the ten directions;

source: གཟུངས་དང་མདོ་སྡེ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ།
en: they had complete mastery of the dhāraṇīs and sūtras;

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་བྱེད་པ།
en: they satisfied all beings with the gift of the Dharma;

source: མངོན་པར་ཤེས་པ་ཆེན་པོའི་ཡེ་ཤེས་བརྗོད་པ་ལ་མཁས་པ།
en: they were skilled in speaking of the wisdom of the higher cognitions;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: they had attained the highest perfection of all the highest perfections;

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་རྣམ་པར་གཞག་པ་ཤེས་པ་ལ་མཁས་པ།
en: they were skilled in the knowledge of remaining in all bodhisattva samādhis and samāpattis;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་ཏེ་རབ་ཏུ་བཀུར་བ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ལ་མཁས་པ།
en: they had been praised, extolled, and lauded by all the buddhas; they were skilled in miraculously going to all buddha realms;

source: བདུད་ཐམས་ཅད་སྐྲག་པར་བྱ་བའི་ཤེས་པ་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་ལ་མཁས་པ།
en: they were skilled in the knowledge of terrifying all māras; they were skilled in the correct knowledge of the nature of all phenomena;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ།
en: they were skilled in the knowledge of the higher and lower capabilities of all beings;

source: སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པའི་ལས་ཡང་དག་པར་སྒྲུབ་པ་ཤེས་པ་ལ་མཁས་པ།
en: they were skilled in the knowledge of accomplishing the activity of offering to all the buddhas;

source: འཇིག་རྟེན་པའི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པ།
en: they were unstained by any of the worldly concerns;

source: ལུས་དང་ངག་དང་སེམས་ཡང་དག་པར་བརྒྱན་པ། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས་པ།
en: they had perfectly adorned bodies, speech, and minds; they wore the armor of great love and great compassion;

source: བསྐལ་པ་གྲངས་མེད་པར་ཡིད་མི་སྐྱོ་བར་བརྩོན་འགྲུས་ཆེ་བ།
en: they had great undiminishing diligence throughout countless eons;

source: སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོག་པ།
en: they roared the great lion’s roar;

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ། ཕྱིར་མི་ལྡོག་པའི་ཕྱག་རྒྱས་བཏབ་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབང་བསྐུར་བ་ཐོབ་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་དང་རབ་ཏུ་ལྷུན་པོ་དང་ལྷུན་པོའི་རྩེ་མོ་འཛིན་དང་ལྷུན་པོ་མར་མེའི་རྒྱལ་པོ་དང་ལྷུན་པོ་བརྩེགས་པ་དང་ལྷུན་པོའི་རྒྱལ་མཚན་དང་ལྷུན་པོའི་རྒྱལ་པོ་དང་ལྷུན་པོའི་རྩེ་མོ་ཀུན་གཡོ་བར་བྱེད་པའི་རྒྱལ་པོ་དང་ལྷུན་པོའི་དབྱངས་དང་། སྤྲིན་གྱི་རྒྱལ་པོ་དང་རྔ་དབྱངས་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་དང་རིན་པོ་ཆེའི་ཏོག་དང་རིན་པོ་ཆེའི་རྩེ་མོ་དང་རིན་པོ་ཆེ་འབྱུང་བ་དང་། རིན་པོ་ཆེ་སྣང་བ་དང་རིན་པོ་ཆེའི་འཁར་བ་དང་ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་རིན་པོ་ཆེའི་བཀོད་པ་དང་རིན་པོ་ཆེའི་དྲ་བ་དང་རིན་པོ་ཆེའི་འོད་དང་རིན་པོ་ཆེའི་གླིང་དང་། དགའ་བར་བྱེད་པ་དང་ཆོས་བཀོད་པ་དང་བཀོད་པའི་རྒྱལ་པོ་དང་མཚན་གྱིས་ཀུན་ཏུ་བརྒྱན་པ་དང་དབྱངས་བཀོད་པ་དང་དབྱངས་རྣམ་པར་དག་པའི་འོད་དང་རིན་པོ་ཆེ་བརྩེགས་པ་དང་ཉི་མ་མེའི་འོད་འཕྲོ་ཅན་དང་སྐར་མ་ལ་དགའ་བ་དང་ཟླ་བའི་འོད་ཟེར་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་གསེར་བཟང་པོ་རྣམ་པར་དག་པའི་འོད་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་ཏུ་མི་འཇིགས་སྦྱིན་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མི་ཕམ་པ་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། འཇམ་དཔལ་ལ་སོགས་པ་སེམས་དཔའ་དཔེ་མེད་པ་དྲུག་ཅུ་དང་། བཟང་སྐྱོང་ལ་སོགས་པ་སྐྱེས་བུ་དམ་པ་བཅུ་དྲུག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། ཚངས་པ་ལ་སོགས་པ་ཚངས་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: they could not be defeated by any opponent; they were sealed with nonregression; and they had received the consecration of the Dharma from all buddhas. They were the bodhisattva mahāsattvas Meru, Sumeru, Mahāmeru, Meru­śikhara­dhara, Meru­pradīpa­rāja, Merukūṭa, Merudhvaja, Merurāja, Meru­śikhara­saṁghaṭṭana­rāja, Merusvara, Megharāja, Dundubhisvara, Ratnapāṇi, Ratnākara, Ratnaketu, Ratnaśikhara, Ratnasaṁbhava, Ratnaprabhāsa, Ratnayaṣṭi, Ratna­mudrā­hasta, Ratnavyūha, Ratnajāli, Ratnaprabha, Ratnadvīpa, Ratiṁkara, Dharmavyūha, Vyūharāja, Lakṣaṇa­samalaṁkṛta, Svaravyūha, Svara­viśuddhi­prabha, Ratnakūṭa, Ratnacūḍa, Daśa­śata­raśmihutārci, Jyotirasa, Candrabhānu, Saha­cittotpāda­dharma­cakra­pravartin, and Śubha­kanaka­viśuddhi­prabha, the bodhisatta mahāsattva Satatam­abhayaṁdad, and all the bodhisattva mahāsattvas of the Good Eon, such as the bodhisattva mahāsattva Ajita, and the sixty with incomparable minds, such as Mañjuśrī, and the sixteen good beings, such as Bhadrapāla, and the Four Mahārājas and the other Cāturmahā­rāja­kāyika devas, and so on up until Brahmā and the other Brahmakāyika devas.

source: དེ་མ་ཡིན་པ་གཞན་ཡང་དབང་ཆེ་བ་དང་དབང་ཆེ་བར་གྲགས་པའི་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་མི་དང་མི་མ་ཡིན་པ་རྒྱ་ཆེ་ཞིང་རླབས་ཆེ་བ་དག་དང་ཐབས་ཅིག་གོ། །བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པར་བྱས།
en: In addition there were also devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, who were all illustrious and renowned as being very powerful.

source: རྗེད་པར་བྱས། གསོལ་བར་བྱས་ཏེ། འཁོར་བཞི་དང་ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་ཕྱག་བྱ་བ། མཆོད་པར་བྱ་བ། བཀུར་སྟིར་བྱ་བ།
en: They honored him, worshiped him, revered him, made offerings to him, praised him, and venerated him. The fourfold assembly and the worlds of devas also paid homage to him, made offerings to him, honored him, worshiped him, revered him, praised him, and venerated him.

source: བླ་མར་བྱ་བ། རི་མོར་བྱ་བ། རྗེད་པར་བྱ་བ། གསོལ་བར་བྱ་བར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏེ། ཚངས་པར་སྤྱོད་པ།
en: Then the Bhagavān, encircled and esteemed by that assembly of many hundred thousands, taught the Dharma.

source: ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། །ཚིག་འབྲུ་བཟང་པོ། །མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ།
en: He taught perfectly the spiritual conduct that is good in the beginning, good in the middle, and good in the end, that has a good meaning, that has good words, and is unalloyed, complete, pure, and wholesome.

source: །དེའི་ཚེ་འཁོར་ཚོགས་པ་དེ་ཉིད་དུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་བ་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། སྐྱེ་བ་དྲན་པ། སྤོབས་པ་ཐོབ་པ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ།
en: At that time, within that gathered assembly there was a youth named Candraprabha, who had honored the jinas in the past, had planted roots of merit, could remember his previous lives, had the confidence of speech, had correctly followed the Mahāyāna, and who was dedicated to great compassion.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་བརྩོན་པ་ཞིག་འདུས་ཏེ་འདུག་པར་གྱུར་ཏོ། །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: The youth Candraprabha rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee, with palms placed together bowed toward the Bhagavān and made this request:

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་བདག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “If the Bhagavān will give me an opportunity to seek answers to them, I have a few questions for the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་གཞོན་ནུ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་དྲི་བ་དྲིས་པ་དེ་དང་དེ་ཉིད་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: The Bhagavān addressed the youth Candraprabha, saying, “Young man, ask whatever question you wish of the Tathāgata, the arhat, the perfectly enlightened Buddha, and I shall gratify you with answers to each and every question you have asked.

source: །གཞོན་ནུ་ང་ནི་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ།
en: “Young man, I am omniscient. I am all-seeing.

source: ཆོས་ཐམས་ཅད་ལ་སྟོབས་དང་མི་འཇིགས་པས་ཁྱུ་མཆོག་ཏུ་གྱུར་པ་རྗེས་སུ་ཐོབ་པ།
en: I have attained preeminence because of my strengths and fearlessness concerning all Dharmas.

source: སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་དང་ལྡན་པ་སྟེ།
en: I possess the unobscured wisdom of liberation.

source: གཞོན་ནུ་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་ལ་མི་མཁྱེན་པའམ། མི་གཟིགས་པའམ། མི་གསན་པའམ། ཐུགས་སུ་མ་ཆུད་པའམ། མངོན་སུམ་དུ་མ་མཛད་པའམ།
en: “Young man, there is nothing in the endless, infinite worlds that the Tathāgata does not know, has not seen, has not heard, has not understood, has not directly perceived, and about which he has not become completely enlightened.

source: མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པ་ཅིའང་མེད་དེ། གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་ལ་དྲི་བ་དང་ཡོངས་སུ་དྲི་བའི་ཕྱིར་ཁྱོད་ལ་རྟག་ཏུ་སྐབས་ཕྱེས། དྲི་བ་དྲིས་པ་དེ་དང་དེ་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: “Young man, may you always have the opportunity to ask questions of the Tathāgata, and I will gratify you with answers for each of the questions you ask.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་བ་དང་། ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: The Bhagavān having given him this opportunity, the young man Candraprabha recited these verses to the Bhagavān:

source: འཇིག་རྟེན་མགོན་པོ་རྫོགས་སངས་རྒྱས།
en: “Lord of the World, Buddha, Illuminator, bringer of benefit,

source: །འོད་མཛད་ཇི་ལྟར་སྤྱད་པ་ཡིས།
en: Elucidate what kind of practice

source: །བསམ་གྱིས་མི་ཁྱབ་ཡེ་ཤེས་འཐོབ། །ཕན་མཛད་ལུང་ཡང་བསྟན་དུ་གསོལ།
en: Will bring the attainment of inconceivable wisdom. {1}

source: །མི་ཡི་ཁྱུ་མཆོག་མི་དང་ལྷས་མཆོད་པ། །མི་དབང་བདེན་གསུངས་ཇི་ལྟར་སྤྱད་པ་ཡིས།
en: “Lord of humans, speaker of the truth, preeminent among humans, To whom humans and devas make offerings, how should one practice

source: །ཐེག་མཆོག་དམ་པ་གཞལ་མེད་ཐོབ་པར་འགྱུར།
en: In order to attain the unfathomable, supreme, highest yāna?

source: །མགོན་པོ་གསུང་མཆོག་ཞུས་པ་ལུང་བསྟན་གསོལ།
en: Lord who has supreme speech, answer this question. {2} “I ask my question with a pure motivation.

source: །བདག་ལ་གཡོ་ནི་མ་མཆིས་ཏེ།
en: There is no guile to be seen within me.

source: །ལྷག་པའི་བསམ་པས་ཞུ་བ་ལགས།
en: I have no witness to that

source: །སྐྱེས་བུ་དམ་པ་མ་གཏོགས་པར། །བདག་གི་དབང་ནི་གཞན་མ་མཆིས།
en: Other than you, sublime being. {3}

source: །འདུན་དང་སྨོན་ལམ་རྒྱ་ཆེ་བདག་ལ་མཆིས།
en: “My prayer and my aspiration are vast.

source: །བདག་གི་སྤྱོད་པ་ཤཱཀྱ་སེང་གེས་མཁྱེན།
en: Śākya lion, you know my conduct.

source: །བདག་ནི་ཚིག་ལ་གཙོར་འཛིན་མ་ལགས་ཀྱིས།
en: I will not be one who prizes words.

source: །མི་དབང་སྒྲུབ་པ་བདག་ལ་མྱུར་དུ་གསུངས། །སངས་རྒྱས་ཐེག་པར་གཅེས་སྤྲས་བགྱིད།
en: Lord of humans, quickly teach me the practice. {4}

source: །ཡོངས་སུ་སྡུད་པའི་ཆོས་རྣམས་གང་།
en: “Which of the Dharmas included

source: །ཆོས་རྣམས་ཀུན་གྱི་མཐར་ཕྱིན་པ། །དཔའ་བོ་ཆེན་པོ་ལུང་བསྟན་གསོལ།
en: In the vehicle of enlightenment are to be cherished? Elucidate for me, great hero, The summit of all Dharmas. {5} “Teach to me, Lord, a beneficial Dharma,

source: །ཅི་ནས་མིས་བསྟེན་ཤེས་རབ་རྣོར་འགྱུར་ཞིང་།
en: Through the practice of which a person will have sharp wisdom,

source: །མི་བཟད་འཇིགས་དང་བྲལ་ཏེ་མི་སྐྲག་པས།
en: Will become free of terrible fears, will be fearless,

source: །ཚུལ་ཁྲིམས་ཕུང་པོ་གཏོང་བར་མི་བགྱིད་ཅིང་།
en: Will never abandon the aggregate of correct conduct, {6}

source: །རྒྱགས་དང་ཞེ་སྡང་གཏི་མུག་ཆགས་བྲལ་ཏེ།
en: “Will be without arrogance, desire, anger, and ignorance,

source: །ཉེས་པ་ཀུན་ཞི་སྤྱད་པ་སྤྱོད་པ་ཡི། །ཕན་པར་བགྱིད་པའི་ཆོས་རྣམས་བདག་ལ་གསུངས།
en: And will practice a conduct in which all faults have ceased. {6b}

source: །ཇི་ལྟར་ཚུལ་ཁྲིམས་མི་གཏོང་ཞིང་།
en: “How does one not abandon correct conduct?

source: །ཇི་ལྟར་བསམ་གཏན་འདོར་མི་འགྱུར།
en: How does one not depart from dhyāna?

source: །དགོན་པ་ལ་ནི་ཇི་ལྟར་བསྟེན།
en: How does one stay in a solitary place?

source: །ཤེས་རབ་དག་གིས་ཇི་ལྟར་འཕེལ།
en: How does wisdom increase? {7} “How does one find joy in maintaining correct conduct

source: །ཇི་ལྟར་སྟོབས་བཅུའི་བསྟན་པ་རྒྱ་ཆེ་ལ། །ཚུལ་ཁྲིམས་སྲུང་ཞིང་མངོན་དགའ་རྙེད་པར་འགྱུར།
en: Within the vast teaching of the one with ten strengths?

source: །ཇི་ལྟར་ཚུལ་ཁྲིམས་ཕུང་པོ་སྐྱོན་མེད་འགྱུར།
en: How can the aggregate of correct conduct be flawless?

source: །ཇི་ལྟར་འདུས་བྱས་རང་བཞིན་འཇལ་བར་འགྱུར།
en: How does one examine the nature of the composite? {8}

source: །ཇི་ལྟར་ལུས་དང་ངག་གིས་ཀྱང་། །མཁས་པ་རྣམ་པར་དག་པར་འགྱུར།
en: “How can the wise be pure In body and in speech,

source: །ཀུན་ནས་ཉོན་མོངས་མེད་སེམས་ཀྱིས།
en: And with an unafflicted mind

source: །སངས་རྒྱས་ཡེ་ཤེས་ཚོལ་བར་འགྱུར།
en: Seek the Buddha’s wisdom? {9}

source: །ལུས་ཀྱི་ལས་ནི་ཇི་ལྟར་རྣམ་དག་འགྱུར།
en: “How can they have pure actions of the body?

source: །ཚིག་གི་སྐྱོན་ནི་ཇི་ལྟར་སྤངས་པར་འགྱུར།
en: How can they avoid faults in speech?

source: །ཇི་ལྟར་སེམས་ལ་ཉོན་མོངས་མེད་པར་འགྱུར།
en: How can they have an unafflicted mind?

source: །སྐྱེས་མཆོག་ཞུས་པ་བདག་ལ་ལུང་བསྟན་གསོལ།
en: Best of men, give your answer to my questions.” {10}

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཅིག་དང་ལྡན་ན་ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: The Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas will attain all those qualities and quickly attain the highest, complete enlightenment of perfect buddhahood if they have one quality. What is that one quality?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་ཡིན།
en: Young man, it is the bodhisattva mahāsattvas’ evenness of mind toward all beings.

source: ཕན་པའི་སེམས་དང་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་མི་མཉམ་པ་མེད་པའི་སེམས་ཡིན་ཏེ།
en: They wish to benefit them, have no anger, and have no partiality.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཅིག་པོ་འདི་དང་ལྡན་ན་ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Young man, if bodhisattva mahāsattvas have that one quality they will attain all those qualities and quickly attain the highest, complete enlightenment of perfect buddhahood.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་དེ་གསུངས་པ།
en: The Bhagavān then recited these verses to the youth Candraprabha:

source: ཆོས་གཅིག་ཡང་དག་བླངས་ནས་ནི།
en: “Having obtained one quality,

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གནས་པ།
en: Those bodhisattvas, whoever they are,

source: །ཡོན་ཏན་འདི་དག་ངེས་ཐོབ་སྟེ།
en: Will attain these qualities

source: །མྱུར་དུ་བྱང་ཆུབ་འཚང་ཡང་རྒྱ།
en: And quickly attain enlightenment. {11}

source: །དེ་ཡི་སེམས་ནི་གང་ལའང་ཞེ་མི་སྡང་།
en: “Anger toward anyone does not arise in the mind

source: །ཞེ་སྡང་མེད་སེམས་བྱང་ཆུབ་སེམས་དཔའ་གང་།
en: Of the bodhisattva who has a mind without anger. Those who are not hardhearted or wicked

source: །ཐ་བ་མི་སྐྱེད་ཞེ་སྡང་མེད་པ་དག །ཁྱད་པར་ཇི་སྐད་བརྗོད་པ་ཐོབ་པར་འགྱུར།
en: Will attain exactly what has been described. {12}

source: །མཉམ་པའི་སེམས་ལ་བསྟེན་པ་ཡིས།
en: “As they remain in evenness of mind,

source: །རྣམ་པར་སྨིན་པ་མཉམ་པར་འགྱུར།
en: There will be an evenness of ripening results:

source: །རྐང་པའི་མཐིལ་ཡང་མཉམ་པ་དང་། །ཆོ་ག་སྤྱོད་ཡུལ་མཉམ་པར་འགྱུར།
en: The soles of their feet will be even And their range of conduct will be even. {13}

source: །མཉམ་ཞིང་མི་མཉམ་མ་ཡིན་སེམས་བསྒོམས་ནས།
en: “They meditate with even minds that are without unevenness.

source: །ཐ་བའི་སྐྱོན་བྲལ་ནེམ་ནུར་རབ་སྤངས་ན།
en: Without the fault of hardheartedness and devoid of craving

source: །དེ་ཡི་རྐང་ལག་མཐིལ་ཡང་མཉམ་འགྱུར་ཏེ།
en: They have even soles and palms.

source: །མཆོག་ཏུ་འོད་གསལ་དག་ཅིང་བལྟ་ན་སྡུག །བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུར་ལྷང་ངེར་སྣང་།
en: They are supremely bright and are seen as pure. {14} “The bodhisattvas illuminate the ten directions,

source: །སངས་རྒྱས་ཞིང་དུ་དཔལ་དང་འོད་ཀྱིས་ཁྱབ།
en: Spreading splendor and light through a buddha realm.

source: །ནམ་དེས་ཞི་བའི་ས་ནི་ཐོབ་པའི་ཚེ།
en: When they attain the level of peace,

source: །སངས་རྒྱས་མཁྱེན་ལ་སེམས་ཅན་མང་པོ་འགོད།
en: They establish many beings in buddha wisdom. {15}

source: །གཞོན་ནུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་དང་། ཕན་པར་སེམས་པ་དང་། སེམས་ཁོང་ཁྲོ་བ་མེད་པ་དང་སེམས་མི་མཉམ་པ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: “Young man, in that way the bodhisattva mahāsattva who has evenness of mind toward all beings, wishes to benefit them, and has no anger or partiality will attain the samādhi known as the revealed equality of the nature of all phenomena.

source: །གཞོན་ནུ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Young man, what is the samādhi called the revealed equality of the nature of all phenomena? “It is restraint of the body. It is restraint of the speech. It is restraint of the mind. It is purity of action. It is the transcendence of the mind’s perceptions. It is knowledge of the skandhas. It is the equality of the dhātus. It is the elimination of the āyatanas. “It is the renunciation of craving. It is having the direct perception of birthlessness. It is engagement in activity. It is the illumination of causes. It is the non-dissipation of the results of karma. It is insight into phenomena. It is the meditation of the path. It is meeting the tathāgatas. “It is sharp wisdom.
